Merge pull request #16 from unnamedboy/feature/docs-architecture-local-cloud
Feature/docs architecture local cloud
